yisea123/based_on_stm32/F4_FreeRTOS/Inc/main.h

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"


/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SPKR_HP_Pin 				        GPIO_PIN_3
#define SPKR_HP_GPIO_Port 			        GPIOE
#define AUDIO_RST_Pin 				        GPIO_PIN_2
#define AUDIO_RST_GPIO_Port 		        GPIOE

#define FMC_NBL1_Pin 				        GPIO_PIN_1
#define FMC_NBL1_GPIO_Port 			        GPIOE
#define FMC_NBL0_Pin 				        GPIO_PIN_0
#define FMC_NBL0_GPIO_Port 		            GPIOE
#define I2C1_SCL_Pin                        GPIO_PIN_8
#define I2C1_SCL_GPIO_Port                  GPIOB
#define uSD_CLK_Pin                         GPIO_PIN_12
#define uSD_CLK_GPIO_Port                   GPIOC
#define SWCLK_Pin                           GPIO_PIN_14
#define SWCLK_GPIO_Port                     GPIOA
#define SWDIO_Pin                           GPIO_PIN_13
#define SWDIO_GPIO_Port                     GPIOA
#define I2C1_SDA_Pin                        GPIO_PIN_9
#define I2C1_SDA_GPIO_Port                  GPIOB
#define OTG_FS1_OverCurrent_Pin             GPIO_PIN_7
#define OTG_FS1_OverCurrent_GPIO_Port       GPIOB
#define QSPI_BK1_NCS_Pin                    GPIO_PIN_6
#define QSPI_BK1_NCS_GPIO_Port              GPIOB
#define SDNCAS_Pin                          GPIO_PIN_15
#define SDNCAS_GPIO_Port                    GPIOG
#define D2_Pin                              GPIO_PIN_0
#define D2_GPIO_Port                        GPIOD
#define uSD_D3_Pin                          GPIO_PIN_11
#define uSD_D3_GPIO_Port                    GPIOC
#define uSD_D2_Pin                          GPIO_PIN_10
#define uSD_D2_GPIO_Port                    GPIOC
#define FMC_NBL2_Pin                        GPIO_PIN_4
#define FMC_NBL2_GPIO_Port                  GPIOI

#define D3_Pin                              GPIO_PIN_1
#define D3_GPIO_Port                        GPIOD
#define D27_Pin                             GPIO_PIN_3
#define D27_GPIO_Port                       GPIOI
#define D26_Pin                             GPIO_PIN_2
#define D26_GPIO_Port                       GPIOI
#define A0_Pin                              GPIO_PIN_0
#define A0_GPIO_Port                        GPIOF
#define FMC_NBL3_Pin                        GPIO_PIN_5
#define FMC_NBL3_GPIO_Port                  GPIOI
#define D29_Pin                             GPIO_PIN_7
#define D29_GPIO_Port                       GPIOI
#define D31_Pin                             GPIO_PIN_10
#define D31_GPIO_Port                       GPIOI
#define D28_Pin                             GPIO_PIN_6
#define D28_GPIO_Port                       GPIOI



#define uSD_CMD_Pin GPIO_PIN_2
#define uSD_CMD_GPIO_Port GPIOD
#define D23_Pin GPIO_PIN_15
#define D23_GPIO_Port GPIOH
#define D25_Pin GPIO_PIN_1
#define D25_GPIO_Port GPIOI
#define A1_Pin GPIO_PIN_1
#define A1_GPIO_Port GPIOF
#define D30_Pin GPIO_PIN_9
#define D30_GPIO_Port GPIOI
#define D21_Pin GPIO_PIN_13
#define D21_GPIO_Port GPIOH
#define D22_Pin GPIO_PIN_14
#define D22_GPIO_Port GPIOH
#define D24_Pin GPIO_PIN_0
#define D24_GPIO_Port GPIOI
#define uSD_D1_Pin GPIO_PIN_9
#define uSD_D1_GPIO_Port GPIOC
#define A2_Pin GPIO_PIN_2
#define A2_GPIO_Port GPIOF
#define uSD_D0_Pin GPIO_PIN_8
#define uSD_D0_GPIO_Port GPIOC
#define A3_Pin GPIO_PIN_3
#define A3_GPIO_Port GPIOF
#define I2C2_SCL_Pin GPIO_PIN_4
#define I2C2_SCL_GPIO_Port GPIOH
#define SDCLK_Pin GPIO_PIN_8
#define SDCLK_GPIO_Port GPIOG
#define A4_Pin GPIO_PIN_4
#define A4_GPIO_Port GPIOF
#define I2C2_SDA_Pin GPIO_PIN_5
#define I2C2_SDA_GPIO_Port GPIOH
#define SDNE0_Pin GPIO_PIN_3
#define SDNE0_GPIO_Port GPIOH

#define QSPI_BK1_IO2_Pin GPIO_PIN_7
#define QSPI_BK1_IO2_GPIO_Port GPIOF
#define QSPI_BK1_IO3_Pin GPIO_PIN_6
#define QSPI_BK1_IO3_GPIO_Port GPIOF
#define A5_Pin GPIO_PIN_5
#define A5_GPIO_Port GPIOF
#define SDCKE0_Pin GPIO_PIN_2
#define SDCKE0_GPIO_Port GPIOH
#define D1_Pin GPIO_PIN_15
#define D1_GPIO_Port GPIOD
#define D15_Pin GPIO_PIN_10
#define D15_GPIO_Port GPIOD
#define QSPI_CLK_Pin GPIO_PIN_10
#define QSPI_CLK_GPIO_Port GPIOF
#define QSPI_BK1_IO1_Pin GPIO_PIN_9
#define QSPI_BK1_IO1_GPIO_Port GPIOF
#define QSPI_BK1_IO0_Pin GPIO_PIN_8
#define QSPI_BK1_IO0_GPIO_Port GPIOF
#define D0_Pin GPIO_PIN_14
#define D0_GPIO_Port GPIOD
#define D14_Pin GPIO_PIN_9
#define D14_GPIO_Port GPIOD
#define D13_Pin GPIO_PIN_8
#define D13_GPIO_Port GPIOD
#define SDNWE_Pin GPIO_PIN_0
#define SDNWE_GPIO_Port GPIOC
#define OTG_FS1_PowerSwitchOn_Pin GPIO_PIN_2
#define OTG_FS1_PowerSwitchOn_GPIO_Port GPIOB
#define A6_Pin GPIO_PIN_12
#define A6_GPIO_Port GPIOF
#define A11_Pin GPIO_PIN_1
#define A11_GPIO_Port GPIOG
#define A9_Pin GPIO_PIN_15
#define A9_GPIO_Port GPIOF
#define uSD_Detect_Pin GPIO_PIN_2
#define uSD_Detect_GPIO_Port GPIOG
#define LCD_INT_Pin GPIO_PIN_5
#define LCD_INT_GPIO_Port GPIOJ
#define D20_Pin GPIO_PIN_12
#define D20_GPIO_Port GPIOH
#define WAKEUP_Pin GPIO_PIN_0
#define WAKEUP_GPIO_Port GPIOA
#define A7_Pin GPIO_PIN_13
#define A7_GPIO_Port GPIOF
#define A10_Pin GPIO_PIN_0
#define A10_GPIO_Port GPIOG
#define D5_Pin GPIO_PIN_8
#define D5_GPIO_Port GPIOE
#define D17_Pin GPIO_PIN_9
#define D17_GPIO_Port GPIOH
#define D19_Pin GPIO_PIN_11
#define D19_GPIO_Port GPIOH
#define A8_Pin GPIO_PIN_14
#define A8_GPIO_Port GPIOF
#define DSI_TE_Pin GPIO_PIN_2
#define DSI_TE_GPIO_Port GPIOJ
#define SDNMT48LC4M32B2B5_6A_RAS_RAS___Pin 					GPIO_PIN_11
#define SDNMT48LC4M32B2B5_6A_RAS_RAS___GPIO_Port 			GPIOF
#define D6_Pin GPIO_PIN_9
#define D6_GPIO_Port GPIOE
#define D8_Pin GPIO_PIN_11
#define D8_GPIO_Port GPIOE
#define D11_Pin GPIO_PIN_14
#define D11_GPIO_Port GPIOE

#define D16_Pin GPIO_PIN_8
#define D16_GPIO_Port GPIOH
#define D18_Pin GPIO_PIN_10
#define D18_GPIO_Port GPIOH
#define LCD_BL_CTRL_Pin GPIO_PIN_3
#define LCD_BL_CTRL_GPIO_Port GPIOA
#define EXT_RESET_Pin GPIO_PIN_0
#define EXT_RESET_GPIO_Port GPIOB
#define D4_Pin GPIO_PIN_7
#define D4_GPIO_Port GPIOE
#define D7_Pin GPIO_PIN_10
#define D7_GPIO_Port GPIOE
#define D9_Pin GPIO_PIN_12
#define D9_GPIO_Port GPIOE
#define D12_Pin GPIO_PIN_15
#define D12_GPIO_Port GPIOE
#define D10_Pin 				GPIO_PIN_13
#define D10_GPIO_Port 			GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
